#+TITLE: Backpropagation Algorithm in Lisp 
#+Author: Bibek Panthi
#+ROAM_REF: https://machinelearningmastery.com/implement-backpropagation-algorithm-scratch-python/
#+DATE: November 16, 2020

\newpage

This [[https://machinelearningmastery.com/implement-backpropagation-algorithm-scratch-python/][tutorial]] was used as reference to implement Backpropagation algorithm.


#+begin_src lisp :tangle backprop.lisp
  (defpackage :backprop
    (:use :cl))

  (in-package :backprop)
#+end_src

** Testing Forward Propagation 
   We create a neural network with 4 inputs a single hidden layer with 2 neurons and an output layer with 2 neurons. 
   Its initialized with random weights and biases and the an input is feed-forwarded 
   finally we get two output values 

   #+begin_src lisp :results value :exports both
     (let ((network (initialize-network (list 4 2 2))))
       (forward-propagate network (vector 1 3 4 8)))
   #+end_src

   #+RESULTS:
   | 0.792232215073208d0 | 0.7556908891941516d0 |
** Test Backprop 
#+begin_src lisp  :exports both
  (let ((network (initialize-network (list 4 2 2))))
    (forward-propagate network (vector 1 3 4 8))
    (backpropagate-error network (vector 1 1))
    network)
#+end_src

#+RESULTS:
: #S(NETWORK
:    :WEIGHTS #(#(#(0.57d0 0.02d0 0.76d0 0.21d0 0.56d0)
:                 #(0.6d0 0.93d0 0.96d0 0.51d0 0.62d0))
:               #(#(0.38d0 0.54d0 0.96d0) #(0.97d0 0.9d0 0.47d0)))
:    :OUTPUTS #(#(0.9995096986821933d0 0.9999798038829305d0)
:               #(0.8175320922581244d0 0.7973073162040141d0))
:    :ERRORS #(#(-1.7235016475997057d-5 -6.262334168591013d-7)
:              #(-0.02721935278516976d0 -0.03275683215785833d0)))
** Testing training 

Input:
#+NAME: data
|          x1 |           x2 | class |
|-------------+--------------+-------|
|   2.7810836 |  2.550537003 |     0 |
| 1.465489372 |  2.362125076 |     0 |
| 3.396561688 |  4.400293529 |     0 |
|  1.38807019 |  1.850220317 |     0 |
|  3.06407232 |  3.005305973 |     0 |
| 7.627531214 |  2.759262235 |     1 |
| 5.332441248 |  2.088626775 |     1 |
| 6.922596716 |   1.77106367 |     1 |
| 8.675418651 | -0.242068655 |     1 |
| 7.673756466 |  3.508563011 |     1 |

#+begin_src lisp :var data=data :results output  :exports both
  (defparameter *network* nil)
  (let ((network (initialize-network (list 2 2 2)))
	(data (loop for (x1 x2 o) in data 
		    collect (list (vector x1 x2) 
				  (vector (if (= o 0) 1 0)
					  (if (= o 0) 0 1))))))
    (train-network network data .5 20)
    (setf *network* network))
#+end_src

#+RESULTS:
#+begin_example
epoch=1,  learning-rate=0.500  error=2.905
epoch=2,  learning-rate=0.500  error=2.780
epoch=3,  learning-rate=0.500  error=2.668
epoch=4,  learning-rate=0.500  error=2.561
epoch=5,  learning-rate=0.500  error=2.447
epoch=6,  learning-rate=0.500  error=2.316
epoch=7,  learning-rate=0.500  error=2.165
epoch=8,  learning-rate=0.500  error=1.994
epoch=9,  learning-rate=0.500  error=1.809
epoch=10,  learning-rate=0.500  error=1.618
epoch=11,  learning-rate=0.500  error=1.432
epoch=12,  learning-rate=0.500  error=1.260
epoch=13,  learning-rate=0.500  error=1.106
epoch=14,  learning-rate=0.500  error=0.972
epoch=15,  learning-rate=0.500  error=0.856
epoch=16,  learning-rate=0.500  error=0.758
epoch=17,  learning-rate=0.500  error=0.674
epoch=18,  learning-rate=0.500  error=0.602
epoch=19,  learning-rate=0.500  error=0.541
epoch=20,  learning-rate=0.500  error=0.489
#+end_example

** Testing on previous data 
#+begin_src lisp :var data=data :results output  :exports both
  (loop for (x1 x2 e) in data do 
    (format t "~&Expected: ~d ~tGot: ~d" e (predict *network* (vector x1 x2))))
#+end_src

#+RESULTS:
#+begin_example
Expected: 0  Got: 0
Expected: 0  Got: 0
Expected: 0  Got: 0
Expected: 0  Got: 0
Expected: 0  Got: 0
Expected: 1  Got: 1
Expected: 1  Got: 1
Expected: 1  Got: 1
Expected: 1  Got: 1
Expected: 1  Got: 1
#+end_example

** Train with all data 
#+begin_src lisp  :exports both
  (defun accuracy (data network)
    "Evaluate accuracy of `network''s prediction on the `data'"
    (truncate (/ (count-if (lambda (datum)
			     (destructuring-bind (input output) datum 
			       (= (predict network input)
				  (position 1 output))))
			   data)
		 (length data))
	      0.01))

  (defparameter *network* 
    (initialize-network (list 7 5 3)))

  (train-network *network* *data* 0.3 500)

  (accuracy *data* *network*)
#+end_src

#+RESULTS:
: 94

94% accuracy 
** Evaluate Algorithm
#+begin_src lisp
  (defun evaluate (data network-neurons number-folds learning-rate epochs)
    (shuffle data)
    (let ((n (truncate (length data) number-folds)))
      (print n)
      (loop repeat number-folds 
	    for i from 0 by n
	    for (test train) = (split data i (+ i n -1))
	    for network = (initialize-network network-neurons) do 
	      (print (list (length test) (length train)))
	      (train-network network 
			     train
			     learning-rate
			     epochs)
	    collect (accuracy test network))))
#+end_src

#+RESULTS:
: EVALUATE

Lets evaluate a single hidden layer neural network with 5 neurons in the hidden layer; taking learning-rate = 0.2 and 500 epochs. And spliting the data 5 times

#+begin_src lisp :exports both
(evaluate *data* (list 7 5 3) 5 0.3 500)
#+end_src

#+name: evaluation-results
#+RESULTS:
| 95 | 92 | 97 | 85 | 92 |

i.e. on average 
#+begin_src lisp :var r=evaluation-results :exports both 
  (truncate (reduce #'+ (first r))
	    (length (first r)))
#+end_src

#+RESULTS:
: 92

92% accuracy
